app/controllers/projects_controller.rb

SELECT * FROM `projects` WHERE (`projects`.`id` = 1)
---
  def edit
    @project = Project.find(params[:id])

INSERT INTO `projects` (`name`, `endtime`, `updated_at`, `future`, `aim`, `description`, `begtime`, `importance`, `state`, `created_at`) VALUES(NULL, '2009-03-31', '2009-03-31 10:45:05', 0, NULL, NULL, '2009-03-31', 0, 0, '2009-03-31 10:45:05')
---
  def create
    @project = Project.new(params[:project])
    @name=@project.name
    respond_to do |format|
      if @project.save

SELECT * FROM `projects` WHERE (`projects`.`id` = 1)
UPDATE `projects` SET `endtime` = '2009-04-04', `begtime` = '2009-03-31', `aim` = '(1) good spoken English\r\n(2) good writing\r\n(3) good listening', `description` = '使用互联网上的资源,提高自己的英语能力.\r\n', `updated_at` = '2009-03-31 11:02:46' WHERE `id` = 1
---
  def update
    @project = Project.find(params[:id])

    respond_to do |format|
      if @project.update_attributes(params[:project])

SELECT * FROM `projects` WHERE (`projects`.`id` = 1)
DELETE FROM `projects` WHERE `id` = 1
---
  def destroy
    @project = Project.find(params[:id])
    @project.destroy