app/controllers/tasks_controller.rb

SELECT * FROM `tasks` WHERE (`tasks`.`id` = 0 AND (`tasks`.project_id = 1)) ORDER BY created_at DESC
---
  def show
    #@task = Task.find(params[:id])
    @task=@project.tasks.find(params[:id])

SELECT * FROM `tasks` WHERE (`tasks`.`id` = 1 AND (`tasks`.project_id = 1)) ORDER BY created_at DESC
---
  def edit
    @task=@project.tasks.find(params[:id])

INSERT INTO `tasks` (`name`, `endtime`, `project_id`, `updated_at`, `aim`, `description`, `begtime`, `state`, `created_at`) VALUES('test', '2009-04-03', 1, '2009-03-31 12:44:25', 'tet', 'test', '2009-04-01', 0, '2009-03-31 12:44:25')
---
  def create
    @task = Task.new(params[:task])

    respond_to do |format|
      if(@project.tasks <<@task)

SELECT * FROM `tasks` WHERE (`tasks`.`id` = 16 AND (`tasks`.project_id = 1)) ORDER BY created_at DESC
UPDATE `tasks` SET `endtime` = '2009-05-08', `begtime` = '2009-05-07', `aim` = 'test', `description` = 'test', `updated_at` = '2009-04-01 16:09:05' WHERE `id` = 36
---
  def update
    @task=@project.tasks.find(params[:id])
    if @task.update_attributes(params[:task])

SELECT * FROM `tasks` WHERE (`tasks`.`id` = 12 AND (`tasks`.project_id = 1)) ORDER BY created_at DESC
DELETE FROM `tasks` WHERE `id` = 12
---
  def destroy
    @task=@project.tasks.find(params[:id])
    @task.destroy

SELECT * FROM `projects` WHERE (`projects`.`id` = 1)
---
  def find_project
    @project_id=params[:project_id]
    return(redirect_to(projects_url)) unless @project_id
    @project=Project.find(@project_id)